{
    "courses": "الدورات",
    "skills": "مهارات",
    "otherSkills": "مهارات اخرى",
    "coding": "برمجة",
    "lightTheme": "فاتح",
    "lightBlueTheme": "أزرق فاتح",
    "darkTheme": "مظلم",
    "darkGoldTheme": "ذهب غامق",
    "system": "نظام",
    "_comment": "Projects",
    "project1Title": "مشروع بحثي - التعرف على المشاعر باستخدام الإشارات الحيوية (09/2022 - 02/2023)",
    "project1Dsc": "• استخدام الإشارات الحيوية للتعرف على المشاعر \n • استخراج ميزات الإشارات الحيوية \n • استخدام الإشارات الحيوية لتدريب خوارزميتين متطورتين للتعرف على المشاعر \n • استخدام الإشارات الحيوية وتقييم أداء النموذج وتحليله.",
    "project2Title": "معالجة مجموعة بيانات كبيرة باستخدام Spark (09/2021 - 01/2022)",
    "project2Dsc": "• إنشاء نماذج للتعلم الآلي ، واختيار النموذج الذي يتمتع بأفضل أداء \n • إنشاء مسار كامل لتعلم الآلة على مجموعة بيانات كبيرة \n • الاستخراج في المستقبل - التعامل مع القيم المفقودة",
    "project3Title": "تصور البيانات (10/2021 - 01/2021)",
    "project3Dsc": "• تصور مجموعة بيانات الوسابي للحصول على نظرة ثاقبة لتوزيع الفنانين عبر القارات وفقًا لأنواعهم الفنية. \n • إنشاء نوعين من المرئيات (خريطة الفقاعة ، مخطط قمعي). \n • معالجة البيانات باستخدام python و R.",
    "project4Title": "مكتشف الحيوانات الأليفة (10/2021 - 1/2022)",
    "project4Dsc": "• توقع ما إذا كان يمكن تبني حيوان في مأوى في غضون 30 يومًا \n • تطبيق نماذج التعلم الآلي \n • الضبط الدقيق للحصول على أفضل المعلمات الفائقة للحصول على توقع دقيق",
    "project5Title": "عين اليقظة: Android و Python - مشروع الماجستير",
    "project5Dsc": "• التقاط الحركات للكاميرا باستخدام raspberry pi لتحديد الكائنات وإرسال إشعار ولقطات شاشة إلى تطبيق الهاتف المحمول. \n • تتبع الكائن لتجنب التقاط لقطات شاشة متعددة لنفس الكائن. \n • اكتشاف الكائن - تتبع الكائن - اكتشاف الحركة.",
    "project6Title": "",
    "project6Dsc": "",
    "_comment1": "Tabs",
    "workExperience": "خبرة في العمل",
    "education": "التعليم",
    "project": "المشاريع",
    "udemy": "Udemy",
    "apps": "تطبيقات",
    "about": "حول",
    "_comment2": "about",
    "myName": "هادي قشمر",
    "profession": "عالم البيانات | طالب ماجستير | مطور موبايل ومدرب",
    "resume": "سيرة ذاتية",
    "_comment3": "Apps",
    "groceryAppTitle": "تطبيق البقالة - دورة Flutter",
    "groceryAppDescription": "Flutter 3.0 و Firebase أنشئ تطبيق بقالة يعمل بكامل طاقته باستخدام لوحة إدارة من البداية مع تكامل بوابة الدفع. \n • دورة كاملة متاحة على Udemy. \n • التطبيق متاح في playstore ، فلا تتردد في تنزيله واختباره.",
    "newsAppTitle": "تطبيق الأخبار - دورة Flutter",
    "converterApp": "تطبيق محول الملفات",
    "ecommerce": "المتجر - دورة Flutter",
    "flutterHelperKit": "Flutter طقم مساعد",
    "flutterAssistant": "Flutter مساعد - مع رمز",
    "workOs": "العمل - نظام التشغيل",
    "teachDriving": "علم القيادة",
    "storeApi": "Store with API",
    "watchfullEye": "العين الساهرة",
    "materialDesign": "تصميم واجهة المستخدم المادية",
    "_comment4": "Education",
    "educationTitleAzur": "علوم البيانات والذكاء الاصطناعي - ماجستير",
    "educationTitleLiu": "هندسة الحاسبات والاتصالات - ماجستير",
    "_comment5": "workExperience",
    "enersysWorkTitle": "مهندس برمجيات أول",
    "enersysWorkDsc": "• قمت بقيادة هندسة وتطوير تطبيقات الويب والجوال باستخدام Flutter وReact، بالتعاون مع الفرق الداخلية والشركاء الخارجيين لتقديم حلول قابلة للتطوير والصيانة تلبي احتياجات العمل.\n• نفذت اختبارات تلقائية للوحدات وأنشأت خطوط CI/CD لضمان نشر سريع وموثوق واكتشاف مبكر للمشكلات. عززت الأمان بدمج تشفير قوي لبيانات المستخدمين وواجهات البرمجة (API).\n• أجريت مراجعات دقيقة للكود وأنشأت أدلة تقنية، مما عزز أفضل الممارسات بين الفرق ورفع جودة الكود والإنتاجية العامة باستمرار.\n• أنشأت وثائق تقنية شاملة للمطورين والمستخدمين النهائيين، مما سهّل عمليات البدء والصيانة ومشاركة المعرفة داخل المؤسسة.\n• قمت بحل المشكلات بشكل استباقي، وإطلاق ميزات جديدة وتحسين أداء التطبيقات، مما أدى إلى تطبيقات أكثر أمانًا واستقرارًا وسرعة للجميع.",
    "dineIntelWorkTitle": "مطور واجهات أمامية ومهندس بيانات (عمل حر - 24/7)",
    "dineIntelWorkDsc": "• صممت وطورت تطبيق جوال متعدد المنصات (iOS/Android) لإدارة النظام الغذائي واكتشاف المطاعم، مما يسمح للمستخدمين بالتسجيل وتخصيص ملفاتهم الشخصية (تفضيلات وحساسيات غذائية) والحصول على توصيات مخصصة.\n• أنشأت موقعًا ترويجيًا باستخدام React لعرض ميزات الشركة، مما وفر منصة جذابة وغنية بالمعلومات للمستخدمين والشركاء المحتملين.\n• قمت بتحليل بيانات المستخدمين وتصميم عروض ديناميكية للمحتوى الغذائي، مستخدمًا AWS لمعالجة البيانات وتخزينها بشكل آمن وتشغيل خلفية قابلة للتوسع.\n• دمجت خرائط Google لمساعدة المستخدمين في العثور على مطاعم قريبة أو البحث في مناطق مختلفة، مع تجربة مستخدم سلسة على جميع الأجهزة.\n• طورت روبوت محادثة غذائي مدعوم بالذكاء الاصطناعي لتقديم نصائح وتوصيات مخصصة للأطباق، مما زاد من تفاعل المستخدمين ودعم خياراتهم الغذائية.\n• أضفت ميزات متقدمة مثل القوائم المفضلة، الشبكات الاجتماعية وتناول الطعام الجماعي، لتمكين المستخدمين من حفظ قوائم أطباقهم ومطاعمهم المفضلة والتواصل مع الآخرين.",
    "udemyWorkTitle": "مدرس دورات - الذكاء الاصطناعي وهندسة البرمجيات",
    "udemyWorkDsc": "• صممت ودرّست دورات تطوير تطبيقات جوال متعددة المنصات تركز على بناء تطبيقات حقيقية، مع نهج عملي يجمع بين تقنيات الواجهة الأمامية (Flutter) والخلفية (Firebase/REST API، Django).\n• أنشأت وحدثت باستمرار مواد تدريبية عملية، تمارين برمجية ومشاريع تطبيقات متكاملة، لضمان اكتساب الطلاب خبرة حديثة وملائمة لسوق العمل.\n• طورت ونشرت تطبيقات iOS/Android كمشاريع تطبيقية ضمن الدورات، ودمجت خدمات Firebase للمصادقة والتخزين السحابي والميزات الفورية، بالإضافة إلى واجهات REST APIs للتكامل مع خدمات الويب.\n• قدمت الإرشاد والدعم التقني لأكثر من 90,000 طالب، وساعدتهم في حل المشكلات البرمجية، وإتقان التقنيات الأساسية وفهم دورة حياة تطوير البرمجيات.\n• حققت الدورات معدلات تسجيل عالية وتقييمات ممتازة، وتم ضم عدة دورات إلى Udemy Business مما زاد من شهرتها والاعتراف بجودتها.\n• عملت في بيئة تقنية حديثة: VS Code، NodeJS، Dart، Python، Flutter، Django.\n• رابط الملف على Udemy: https://www.udemy.com/user/hadi-kachmar-2/",
    "amadeusWorkTitle": "أماديوس – عالم بيانات ومهندس (تدريب)",
    "amadeusWorkDsc": "• حللت مجموعات بيانات ضخمة حول جمهور المسافرين لاستخلاص رؤى استراتيجية، وتحديد الاتجاهات واكتشاف تطبيقات جديدة للتعلم الاتحادي (Federated Learning) في تقنيات السفر.\n• طورت وحسّنت تدفقات ETL على Azure Databricks، مما حسّن من كفاءة معالجة البيانات وجودتها وضمان موثوقية تدفق البيانات لتحليلها لاحقًا.\n• حسّنت تصنيف البيانات وأساليب الفلترة، مما أدى إلى زيادة سلامة البيانات ونتائج تحليلية أكثر قابلية للتطبيق لأصحاب المصلحة.\n• صممت ونفذت نماذج ذكاء اصطناعي متقدمة باستخدام التعلم الاتحادي، مما أدى إلى تطوير إدارة بيانات لامركزية وزيادة دقة التنبؤ في التحليلات.\n• أنشأت تصورات متقدمة للبيانات باستخدام PySpark وPandas، مما مكّن من تمثيل البيانات التحليلية المعقدة بشكل واضح لدعم اتخاذ القرار.",
    "inriaWorkTitle": "تعلم الآلة – تدريب",
    "inriaWorkDsc": "• طورت نموذج تعلم آلي للتعرف على العواطف متعدد المصادر، يدمج النص والصوت والفيديو والإشارات الحيوية من أنظمة المراقبة بالفيديو (CCTV) لتحسين دقة التنبؤ في البيئات الواقعية.\n• قمت بإدارة تحضير البيانات من البداية للنهاية، بما في ذلك جمع البيانات وعمليات ETL باستخدام NEF على عنقود لينكس، وتنظيف البيانات والمعالجة المسبقة لتوفير مدخلات تدريب قوية.\n• أتمتت معالجة البيانات وتدفق العمل على السحابة باستخدام سكربتات شل على لينكس، مما حسن من كفاءة عمليات خطوط البيانات وقابليتها للتكرار.\n• صممت ودربت نماذج على مجموعات بيانات متعددة المصادر، واستخرجت الميزات عبر جميع الوسائط وقمت بتحسين النماذج لمهام التنبؤ المعقدة والآنية.\n• أنشأت لوحات بيانات تفاعلية باستخدام Power BI واستخدمت خوارزمية T-SNE لتصور البيانات عالية الأبعاد، مما دعم تفسير النتائج وتقديمها.",
    "dowGroupWorkTitle": "داو جروب – مطور واجهات أمامية",
    "dowGroupWorkDsc": "• طورت، حافظت وقمت بإصلاح مجموعة واسعة من تطبيقات الجوال، مقدمًا حلولًا متعددة المنصات لمشاريع داخلية وللعملاء.\n• أنشأت تطبيقات قوية باستخدام Dart/Flutter للنشر السلس على iOS وAndroid، مما سمح بإعادة استخدام الكود وتسريع تطوير الميزات.\n• طبقت وظائف مخصصة لأندرويد باستخدام Java/XML، ودمجت قدرات أصلية لتحسين تجربة المستخدم وأداء التطبيقات.\n• قادت اختبارات الكود ونفذت خطوط CI/CD باستخدام GitHub Actions، مما ضمن إصدارات موثوقة وتقليل المشكلات بعد النشر.\n• دمجت WooCommerce في تطبيقات الجوال، موسعًا من إمكانيات التجارة الإلكترونية وموفرًا معاملات آمنة وسلسة للمستخدمين.\n• عملت في بيئة Agile واستخدمت JIRA لإدارة المشاريع والتعاون، مما ساهم في تسليم المشاريع بكفاءة والتكيف مع المتطلبات المتغيرة.",
    "achievementsTasks": "المساهمات الرئيسية",
    "note": "ملحوظة",
    "appNote": "هناك تطبيقات أخرى قمت بإنشائها طوال حياتي المهنية ولكن لا يمكنني الكشف عنها بسبب خصوصية العميل.",
    "_comment6": "lang",
    "english": "إنجليزي",
    "french": "الفرنسية",
    "arabic": "عربي",
    "": ""
}