{
    "courses": "Courses",
    "skills": "Skills",
    "otherSkills": "Other Skills",
    "coding": "Coding",
    "lightTheme": "Light",
    "lightBlueTheme": "Light Blue",
    "darkTheme": "Dark",
    "darkGoldTheme": "Dark Gold",
    "system": "System",
    "_comment": "Projects",
    "project1Title": "Research Project - Emotion Recognition Using Bio-Signals (09/2022 - 02/2023)",
    "project1Dsc": "• Utilized bio-signals to recognize emotions\n• Extracted bio-signal features\n• Trained two state-of-the-art algorithms for emotion recognition using these bio-signals\n• Assessed and analyzed the model's performance.",
    "project2Title": "Processing Large Dataset with Spark (09/2021 - 01/2022)",
    "project2Dsc": "• Built machine learning models and selected the one with the best performance\n• Constructed a full machine learning pipeline on a large dataset\n• Handled feature extraction and missing values",
    "project3Title": "Data Visualization (10/2021 - 01/2022)",
    "project3Dsc": "• Visualized the WASABI dataset to gain insights into the distribution of artists across continents according to their genres. \n• Built two types of visualizations: Bubble map and funnel chart. \n• Processed data using Python and R.",
    "project4Title": "Pet Finder (10/2021 - 1/2022)",
    "project4Dsc": "• Predicted if an animal in a shelter would be adopted within 30 days\n• Applied machine learning models \n• Fine-tuned to optimize the hyper-parameters for accurate prediction",
    "project5Title": "Watchful Eye: Android and Python Master Project (11/2019 - 06/2020)",
    "project5Dsc": "• Captured motions with a Raspberry Pi camera to identify objects and send notifications and screenshots to the mobile application.\n• Tracked objects to avoid taking multiple screenshots of the same object. \n• Focused on object detection, object tracking, and motion detection.",
    "project6Title": "",
    "project6Dsc": "",
    "_comment1": "Tabs",
    "workExperience": "Work Experience",
    "education": "Education",
    "project": "Projects",
    "udemy": "Udemy",
    "apps": "Apps",
    "about": "About",
    "_comment2": "About",
    "myName": "Hadi Kachmar",
    "profession": "Data Scientist | Master's Student | Mobile Developer & Instructor",
    "resume": "Resume",
    "_comment3": "Apps",
    "groceryAppTitle": "Grocery App - Flutter Course",
    "groceryAppDescription": "A fully functional grocery app with an Admin panel built from scratch using Flutter 3.0 and Firebase, featuring payment gateway integration. \n• Full course is available on Udemy. \n• The app is available on Play Store, feel free to download and test it.",
    "newsAppTitle": "News App - Flutter Course",
    "converterApp": "File Converter App",
    "ecommerce": "Flutter Shop - Flutter Course",
    "flutterHelperKit": "Flutter Helper Kit",
    "flutterAssistant": "Flutter Assistant - With Code",
    "workOs": "Work - Operating System",
    "teachDriving": "Teach Driving",
    "storeApi": "Store with API",
    "watchfullEye": "Watchful Eye",
    "materialDesign": "Material UI Design",
    "_comment4": "Education",
    "educationTitleAzur": "Data Science & Artificial Intelligence - MSc",
    "educationTitleLiu": "Computer & Communication Engineering - MSc",
    "_comment5": "Work Experience",
    "enersysWorkTitle":"Senior Software Engineer", 
    "enersysWorkDsc":"• Led the architecture and development of web and mobile applications using Flutter and React, collaborating with internal teams and external partners to deliver scalable and maintainable solutions tailored to business needs. \n• Implemented automated unit testing and CI/CD pipelines, ensuring fast, reliable deployments and early detection of issues. Enhanced security by integrating robust encryption for user and API credentials. \n• Conducted in-depth code reviews and established technical guidelines, fostering best practices across teams and continuously improving overall code quality and team productivity. \n• Created comprehensive technical documentation for both developers and end users, facilitating easier onboarding, maintenance, and knowledge sharing throughout the organization. \n• Proactively resolved bugs, released new features, and optimized app performance, resulting in more secure, stable, and responsive applications for all stakeholders.",
    "dineIntelWorkTitle":"Front-End Developer & Data Engineer (Freelance - 24/7)",
    "dineIntelWorkDsc":"• Designed and developed a cross-platform mobile app (iOS/Android) for dietary management and restaurant discovery, enabling users to register, personalize their profiles with dietary preferences and allergies, and receive tailored recommendations. \n• Built a promotional website using React to showcase company features, providing an engaging and informative platform for potential users and partners. \n• Performed user data analysis and dynamic visualization of nutritional content, leveraging AWS for data processing, secure storage, and scalable backend operations. \n• Integrated Google Maps functionality to help users discover nearby restaurants or search for dining options in different locations, with seamless user experience across devices. \n• Developed an AI-powered nutritional chatbot to deliver personalized advice and dish recommendations, enhancing user engagement and supporting informed dietary choices. \n• Added advanced features such as favorites, social networking, and group dining, allowing users to curate dish and restaurant lists and connect with others for shared dining experiences.",
    "udemyWorkTitle":"Course Instructor - AI & Software Engineering",
    "udemyWorkDsc":"• Designed and taught cross-platform mobile development courses focused on building real-world production apps, with a practical approach combining both front-end (Flutter) and back-end (Firebase/REST API, Django) technologies. \n• Created and regularly updated hands-on training materials, coding exercises, and complete app projects, ensuring that students gained industry-relevant, up-to-date experience. \n• Developed and published iOS/Android apps as course examples, integrating Firebase for authentication, cloud storage, and real-time features, as well as REST APIs for robust web service interaction. \n• Provided technical mentorship and support to over 90,000 students, helping them troubleshoot code, master key frameworks, and understand the software development lifecycle. \n• Achieved high enrollment and excellent ratings, with multiple courses included in Udemy Business, significantly expanding the reach and recognition for course quality. \n• Worked in a modern tech environment, using tools such as VS Code, NodeJS, Dart, Python, Flutter, and Django. \n• Udemy Profile: https://www.udemy.com/user/hadi-kachmar-2/",
    "amadeusWorkTitle": "Amadeus – Data Scientist & Engineer (Internship)",
    "amadeusWorkDsc": "• Analyzed large-scale travel audience datasets to extract strategic business insights, identify trends, and discover new applications for Federated Learning in travel technology. \n• Developed and optimized ETL workflows on Azure Databricks, improving data processing efficiency, enhancing quality, and ensuring reliable data pipelines for downstream analytics. \n• Enhanced data categorization and filtering methods, resulting in improved data integrity and more actionable insights for business and technical stakeholders. \n• Designed and implemented advanced AI models using Federated Learning, pioneering decentralized data management approaches and boosting predictive accuracy for analytics use cases. \n• Built advanced data visualizations with PySpark and Pandas, enabling clear and actionable representation of complex analytics to support decision-making.",
    "inriaWorkTitle": "Machine Learning - Internship",
    "inriaWorkDsc": "• Developed a machine learning model for multimodal emotion recognition, integrating text, audio, video, and biosignals from CCTV systems to enhance prediction accuracy in real-world surveillance environments. \n• Led end-to-end data preparation, including data collection and ETL using NEF on a Linux cluster, comprehensive data cleaning, and preprocessing to provide robust training inputs. \n• Automated data manipulation and workflows on the cloud using Linux shell scripting, improving pipeline efficiency and reproducibility. \n• Engineered and trained models on multi-source datasets, conducting feature extraction across modalities and optimizing for complex, real-time prediction tasks. \n• Designed interactive dashboards with Power BI and applied the T-SNE algorithm to visualize high-dimensional data, supporting model interpretation and result communication.",
    "dowGroupWorkTitle": "Dow Group – Front-End Developer",
    "dowGroupWorkDsc": "• Developed, maintained, and debugged a wide range of mobile applications, delivering cross-platform solutions for both internal projects and client needs. \n• Built robust mobile apps using Dart/Flutter for seamless deployment on both iOS and Android, enabling efficient code sharing and rapid feature updates. aaaa Implemented Android-specific features with Java/XML, integrating platform-native capabilities to enhance user experience and app performance. aaaa Led code testing initiatives and implemented CI/CD pipelines using GitHub Actions, ensuring reliable releases and minimizing post-deployment issues. \n• Integrated WooCommerce into mobile applications, expanding e-commerce functionalities and providing smooth, secure user transactions. \n• Operated within an Agile environment and utilized JIRA for project management and team collaboration, delivering projects efficiently and adapting to evolving requirements.",
   
    "achievementsTasks": "Key Contributions",
    "note": "Note",
    "appNote": "There are additional apps that I have created throughout my career but cannot reveal due to client confidentiality.",
    "_comment6": "Language",
    "english": "English",
    "french": "French",
    "arabic": "Arabic",
    "": ""
}