{
    "courses": "Cours",
    "skills": "Compétences",
    "otherSkills": "Autres compétences",
    "coding": "Codage",
    "lightTheme": "Clair",
    "lightBlueTheme": "Bleu clair",
    "darkTheme": "Sombre",
    "darkGoldTheme": "Or Sombre",
    "system": "Système",
    "_comment": "Projects",
    "project1Title": "Projet de recherche - Reconnaissance des émotions par Bio-Signals (09/2022 - 02/2023)",
    "project1Dsc": "• Utilisation de biosignaux pour reconnaître les émotions\n• Extraire les caractéristiques des biosignaux\n• Utiliser les biosignaux pour former deux algorithmes de pointe pour la reconnaissance des émotions\n• À l'aide des biosignaux, évaluer et analyser les performances du modèle.",
    "project2Title": "Traitement d'un grand ensemble de données avec Spark (09/2021 - 01/2022)",
    "project2Dsc": "• Créez des modèles de machine learning et choisissez celui qui offre les meilleures performances\n• Créez un pipeline de machine learning complet sur un grand ensemble de données\n• Extraction future : gestion des valeurs manquantes",
    "project3Title": "Visualisation des données (10/2021 - 01/2021)",
    "project3Dsc": "• Visualisation de l'ensemble de données WASABI pour avoir un aperçu de la répartition des artistes sur les continents en fonction de leurs genres. \n• Création de 2 types de visualisation (carte à bulles, graphique en entonnoir). \n• Traitement des données avec Python et R.",
    "project4Title": "Recherche d'animaux (10/2021 - 1/2022)",
    "project4Dsc": "• Prédire si un animal dans un refuge peut être adopté dans les 30 jours\n• Appliquer des modèles de machine learning\n• affiner pour obtenir les meilleurs hyper-paramètres pour une prédiction précise",
    "project5Title": "Watchful Eye: Projet de maîtrise Android et Python",
    "project5Dsc": "• Caméra de capture de mouvements avec un raspberry pi pour identifier les objets et envoyer une notification et des captures d'écran à l'application mobile.\n• Suivi des objets pour éviter de prendre plusieurs captures d'écran du même objet. \n• Détection d'objet - Suivi d'objet - Détection de mouvement.",
    "project6Title": "",
    "project6Dsc": "",
    "_comment1": "Tabs",
    "workExperience": "L'expérience professionnelle",
    "education": "Éducation",
    "project": "Projets",
    "udemy": "Udemy",
    "apps": "Applications",
    "about": "À propos de",
    "_comment2": "about",
    "myName": "Hadi Kachmar",
    "profession": "Scientifique des données | Étudiant à la maîtrise | Développeur mobile et instructeur",
    "resume": "CV",
    "_comment3": "Apps",
    "groceryAppTitle": "Application d'épicerie - Flutter Course",
    "groceryAppDescription": "Flutter 3.0 & Firebase Créez une application d'épicerie entièrement fonctionnelle avec un panneau d'administration À partir de zéro avec l'intégration de la passerelle de paiement. \n• Le cours complet est disponible sur Udemy. \n• L'application est disponible sur Playstore, n'hésitez pas à la télécharger et à la tester.",
    "newsAppTitle": "App Nouvelles - Cours Flutter",
    "converterApp": "Application de conversion de fichiers",
    "ecommerce": "Boutique - Cours de Flutter",
    "flutterHelperKit": "Kit d'aide au Flutter",
    "flutterAssistant": "Assistant Flutter - avec code",
    "workOs": "Travail - Système d'exploitation",
    "teachDriving": "Enseigner la conduite",
    "storeApi": "Store with API",
    "watchfullEye": "Oeil attentif",
    "materialDesign": "Conception de l'interface utilisateur matérielle",
    "_comment4": "Education",
    "educationTitleAzur": "Science des données et intelligence artificielle - MSc",
    "educationTitleLiu": "Ingénierie informatique et communication-MSc",
    "_comment5": "workExperience",
    "amadeusWorkTitle": "Data Scientist - Stage",
    "amadeusWorkDsc": "• A revu des articles scientifiques publics sur l'apprentissage fédéré Cross-Silo\n• A reproduit les conclusions des articles académiques pour vérifier les résultats de recherche\n• A examiné la durabilité de l'apprentissage fédéré Cross-Silo\n• A évalué les informations complémentaires de divers silos en utilisant pNML",
    "inriaWorkTitle": "Apprentissage automatique - Stage",
    "inriaWorkDsc": "• Extraire les caractéristiques visuelles (image), acoustiques (voix) et linguistiques (texte) de l'ensemble de données CMU MOSEI et MEAD \n• Entraîner les algorithmes de reconnaissance des émotions multimodales de pointe à l'aide des caractéristiques extraites\n• Analyser les performances des algorithmes de reconnaissance des émotions, y compris le calcul de la matrice de confusion, la précision équilibrée, le score F1\n• Visualisez les caractéristiques extraites à l'aide de l'algorithme T-SNE",
    "dowGroupWorkTitle": "Développeur mobile",
    "dowGroupWorkDsc": "• Développement d'applications mobiles avec Flutter/Dart et Java/XML \n• Maintenir et corriger les bogues des applications mobiles \n• Améliorer la vitesse et les performances des applications mobiles \n• Tests UX et amélioration de la conception des applications",
    "freelanceMobileDevTitle": "Développeur mobile indépendant",
    "freelanceMobileDevDsc": "• Développer et maintenir des applications mobiles\n• Consultant en gestion d'applications\n• Déployer des applications sur le Store",
    "achievementsTasks": "Réalisations/Tâches",
    "note": "Noter",
    "appNote": "Il existe d'autres applications que j'ai créées tout au long de ma carrière mais que je ne peux pas révéler en raison de la confidentialité du client.",
    "_comment6": "lang",
    "english": "Anglais",
    "french": "Français",
    "arabic": "Arabe",
    "": ""
}