{
    "courses": "Cours",
    "skills": "Compétences",
    "otherSkills": "Autres compétences",
    "coding": "Codage",
    "lightTheme": "Clair",
    "lightBlueTheme": "Bleu clair",
    "darkTheme": "Sombre",
    "darkGoldTheme": "Or Sombre",
    "system": "Système",
    "_comment": "Projects",
    "project1Title": "Projet de recherche - Reconnaissance des émotions par Bio-Signals (09/2022 - 02/2023)",
    "project1Dsc": "• Utilisation de biosignaux pour reconnaître les émotions\n• Extraire les caractéristiques des biosignaux\n• Utiliser les biosignaux pour former deux algorithmes de pointe pour la reconnaissance des émotions\n• À l'aide des biosignaux, évaluer et analyser les performances du modèle.",
    "project2Title": "Traitement d'un grand ensemble de données avec Spark (09/2021 - 01/2022)",
    "project2Dsc": "• Créez des modèles de machine learning et choisissez celui qui offre les meilleures performances\n• Créez un pipeline de machine learning complet sur un grand ensemble de données\n• Extraction future : gestion des valeurs manquantes",
    "project3Title": "Visualisation des données (10/2021 - 01/2021)",
    "project3Dsc": "• Visualisation de l'ensemble de données WASABI pour avoir un aperçu de la répartition des artistes sur les continents en fonction de leurs genres. \n• Création de 2 types de visualisation (carte à bulles, graphique en entonnoir). \n• Traitement des données avec Python et R.",
    "project4Title": "Recherche d'animaux (10/2021 - 1/2022)",
    "project4Dsc": "• Prédire si un animal dans un refuge peut être adopté dans les 30 jours\n• Appliquer des modèles de machine learning\n• affiner pour obtenir les meilleurs hyper-paramètres pour une prédiction précise",
    "project5Title": "Watchful Eye: Projet de maîtrise Android et Python",
    "project5Dsc": "• Caméra de capture de mouvements avec un raspberry pi pour identifier les objets et envoyer une notification et des captures d'écran à l'application mobile.\n• Suivi des objets pour éviter de prendre plusieurs captures d'écran du même objet. \n• Détection d'objet - Suivi d'objet - Détection de mouvement.",
    "project6Title": "",
    "project6Dsc": "",
    "_comment1": "Tabs",
    "workExperience": "L'expérience professionnelle",
    "education": "Éducation",
    "project": "Projets",
    "udemy": "Udemy",
    "apps": "Applications",
    "about": "À propos de",
    "_comment2": "about",
    "myName": "Hadi Kachmar",
    "profession": "Scientifique des données | Étudiant à la maîtrise | Développeur mobile et instructeur",
    "resume": "CV",
    "_comment3": "Apps",
    "groceryAppTitle": "Application d'épicerie - Flutter Course",
    "groceryAppDescription": "Flutter 3.0 & Firebase Créez une application d'épicerie entièrement fonctionnelle avec un panneau d'administration À partir de zéro avec l'intégration de la passerelle de paiement. \n• Le cours complet est disponible sur Udemy. \n• L'application est disponible sur Playstore, n'hésitez pas à la télécharger et à la tester.",
    "newsAppTitle": "App Nouvelles - Cours Flutter",
    "converterApp": "Application de conversion de fichiers",
    "ecommerce": "Boutique - Cours de Flutter",
    "flutterHelperKit": "Kit d'aide au Flutter",
    "flutterAssistant": "Assistant Flutter - avec code",
    "workOs": "Travail - Système d'exploitation",
    "teachDriving": "Enseigner la conduite",
    "storeApi": "Store with API",
    "watchfullEye": "Oeil attentif",
    "materialDesign": "Conception de l'interface utilisateur matérielle",
    "_comment4": "Education",
    "educationTitleAzur": "Science des données et intelligence artificielle - MSc",
    "educationTitleLiu": "Ingénierie informatique et communication-MSc",
    "_comment5": "workExperience",
    "enersysWorkTitle": "Ingénieur Logiciel Senior",
    "enersysWorkDsc": "• Dirigé l’architecture et le développement d’applications web et mobiles avec Flutter et React, en collaboration avec des équipes internes et des partenaires externes pour fournir des solutions évolutives et maintenables adaptées aux besoins métiers.\n• Mis en place des tests unitaires automatisés et des pipelines CI/CD, garantissant des déploiements rapides, fiables et une détection précoce des problèmes. Renforcé la sécurité par l’intégration d’un chiffrement robuste pour les identifiants utilisateurs et API.\n• Réalisé des revues de code approfondies et établi des guides techniques, encourageant les bonnes pratiques au sein des équipes et améliorant en continu la qualité du code et la productivité collective.\n• Rédigé une documentation technique complète à destination des développeurs et utilisateurs finaux, facilitant l’onboarding, la maintenance et le partage des connaissances.\n• Résolu de façon proactive les bugs, livré de nouvelles fonctionnalités et optimisé la performance des applications pour plus de sécurité, de stabilité et de réactivité pour tous les utilisateurs.",
    "dineIntelWorkTitle": "Développeur Front-End & Ingénieur Data (Freelance - 24/7)",
    "dineIntelWorkDsc": "• Conçu et développé une application mobile multiplateforme (iOS/Android) pour la gestion alimentaire et la recherche de restaurants, permettant aux utilisateurs de s’inscrire, de personnaliser leur profil (préférences et allergies) et de recevoir des recommandations ciblées.\n• Créé un site web promotionnel avec React pour présenter les fonctionnalités de l’entreprise, offrant une plateforme attrayante et informative pour les utilisateurs et partenaires potentiels.\n• Analysé les données utilisateurs et réalisé la visualisation dynamique des contenus nutritionnels, en exploitant AWS pour le traitement des données, le stockage sécurisé et la scalabilité du backend.\n• Intégré Google Maps pour permettre aux utilisateurs de trouver des restaurants à proximité ou de rechercher des adresses dans n’importe quelle zone, avec une expérience fluide sur tous les appareils.\n• Développé un chatbot nutritionnel alimenté par l’IA pour fournir des conseils personnalisés et des recommandations de plats, renforçant l’engagement et l’accompagnement des utilisateurs.\n• Ajouté des fonctionnalités avancées : favoris, réseau social et gestion de groupes pour permettre aux utilisateurs de sauvegarder leurs restaurants et plats préférés, et de partager des expériences culinaires.",
    "udemyWorkTitle": "Formateur de Cours - IA & Génie Logiciel",
    "udemyWorkDsc": "• Conçu et dispensé des cours de développement mobile multiplateforme axés sur la création d’applications de production réelles, avec une approche pratique associant les technologies front-end (Flutter) et back-end (Firebase/REST API, Django).\n• Créé et régulièrement mis à jour des supports pratiques, exercices de code et projets complets, garantissant aux étudiants une expérience à la fois actuelle et orientée métier.\n• Développé et publié des applications iOS/Android en exemples de cours, intégrant Firebase pour l’authentification, le stockage cloud et les fonctionnalités temps réel, ainsi que des API REST pour les interactions web.\n• Offert mentorat et assistance technique à plus de 90 000 étudiants, les aidant à résoudre des problèmes de code, maîtriser les frameworks clés et comprendre le cycle de développement logiciel.\n• Atteint un fort taux d’inscriptions et d’excellentes évaluations, avec plusieurs cours inclus dans Udemy Business, ce qui a largement accru leur visibilité et reconnaissance.\n• Travaillé dans un environnement technique moderne : VS Code, NodeJS, Dart, Python, Flutter, Django.\n• Profil Udemy : https://www.udemy.com/user/hadi-kachmar-2/",
    "amadeusWorkTitle": "Amadeus – Data Scientist & Ingénieur (Stage)",
    "amadeusWorkDsc": "• Analysé de grands ensembles de données liés aux audiences du secteur du voyage afin d’extraire des insights stratégiques, d’identifier les tendances et de proposer des applications innovantes de Federated Learning dans la travel tech.\n• Développé et optimisé des workflows ETL sur Azure Databricks, améliorant l’efficacité du traitement, la qualité des données et la fiabilité des pipelines analytiques.\n• Amélioré la catégorisation et le filtrage des données, aboutissant à une meilleure intégrité des jeux de données et à des analyses plus actionnables pour les équipes métier et techniques.\n• Conçu et implémenté des modèles IA avancés exploitant le Federated Learning, pionnier dans la gestion décentralisée des données et l’amélioration de la précision prédictive.\n• Réalisé des visualisations avancées avec PySpark et Pandas, rendant accessible la lecture de données complexes pour l’aide à la décision.",
    "inriaWorkTitle": "Machine Learning – Stage",
    "inriaWorkDsc": "• Développé un modèle de machine learning pour la reconnaissance multimodale des émotions, intégrant texte, audio, vidéo et biosignaux à partir de systèmes de vidéosurveillance pour améliorer la précision des prédictions en conditions réelles.\n• Piloté la préparation des données de bout en bout, incluant la collecte et l’ETL avec NEF sur cluster Linux, ainsi que le nettoyage et le prétraitement approfondis pour fournir des jeux d’entraînement robustes.\n• Automatisé la manipulation des données et les workflows sur le cloud via des scripts shell Linux, renforçant l’efficacité et la reproductibilité des pipelines.\n• Conçu et entraîné des modèles sur des datasets multisources, en extrayant les caractéristiques pertinentes de chaque modalité et en optimisant les performances en temps réel.\n• Créé des tableaux de bord interactifs avec Power BI et utilisé l’algorithme T-SNE pour visualiser des données haute dimension, facilitant l’interprétation et la restitution des résultats.",
    "dowGroupWorkTitle": "Dow Group – Développeur Front-End",
    "dowGroupWorkDsc": "• Développé, maintenu et débogué une large gamme d’applications mobiles, livrant des solutions multiplateformes pour des projets internes et clients.\n• Conçu des applications robustes avec Dart/Flutter pour un déploiement transparent sur iOS et Android, optimisant la mutualisation du code et la rapidité des évolutions.\n• Implémenté des fonctionnalités Android natives avec Java/XML, intégrant des capacités spécifiques pour enrichir l’expérience utilisateur et la performance des applications.\n• Piloté les tests de code et la mise en place de pipelines CI/CD avec GitHub Actions, assurant des livraisons fiables et une réduction des incidents post-déploiement.\n• Intégré WooCommerce aux applications mobiles, élargissant les fonctionnalités e-commerce et offrant des transactions utilisateurs fluides et sécurisées.\n• Travaillé en environnement Agile et utilisé JIRA pour la gestion de projet et la collaboration, garantissant l’efficacité des livraisons et l’adaptabilité aux évolutions des besoins.",
    "achievementsTasks": "contribution clé",
    "note": "Noter",
    "appNote": "Il existe d'autres applications que j'ai créées tout au long de ma carrière mais que je ne peux pas révéler en raison de la confidentialité du client.",
    "_comment6": "lang",
    "english": "Anglais",
    "french": "Français",
    "arabic": "Arabe",
    "": ""
}